{
  "redditPosts": [
    {
      "script": "A woman, cranky because her husband was late coming home again, decided to leave a note, saying, \"I've had enough and have left you. Don't bother coming after me.”. Then she hid under the bed to see his reaction.\n\nAfter a short while, the husband comes home and she could hear him in the kitchen before he comes into the bedroom.\n\nShe could see him walk towards the dresser and pick up the note.\n\nAfter a few minutes, he wrote something on it before picking up the phone and calling someone.\n\n\"She's finally gone...yeah I know, about bloody time, I'm coming to see you, put on that sexy French nightie.\n\nI love you...can't wait to see you...we'll do all the naughty things you like.\"\n\nHe hung up, grabbed his keys and left.\n\nShe heard the car drive off as she came out from under the bed.\n\nSeething with rage and with tears in her eyes she grabbed the note to see what he wrote...\n\n\"I can see your feet. We're outta bread: be back in five minutes.\".",
      "title": "A woman, cranky because her husband was late coming home again, decided to leave a note, saying, \"I've had enough and have left you. Don't bother coming after me.”",
      "score": 33745,
      "subreddit": "jokes",
      "commentCount": 74,
      "url": "https://www.reddit.com/r/Jokes/comments/10oyyv5/a_woman_cranky_because_her_husband_was_late/",
      "tags": "A woman, cranky because her husband was late coming home again, decided to leave a note, saying, \"I've had enough and have left you. Don't bother coming after me.” \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A woman is having an affair during the day while her husband is at work. Her 9 year old son comes home unexpectedly, sees them and hides in the bedroom closet to watch. The woman’s husband also comes home. She puts her lover in the closet, not realizing that the little boy is in there already.\n\nThe little boy says, “Its dark in here.”\n\nThe man says, “Yes, it is.”\n\nBoy ~ “I have a baseball.”\n\nMan ~ “That’s nice.”\n\nBoy ~ “Want to buy it?”\n\nMan ~ “No, thanks.”\n\nBoy ~ “My dad’s outside.”\n\nMan ~ “OK, how much?”\n\nBoy ~ “$250?\n\nIn the next few weeks, it happens again that the boy and the lover are in the closet together.\n\nBoy ~ “Its dark in here.”\n\nMan ~ “Yes, it is.”\n\nBoy ~ “I have a baseball glove.”\n\nThe lover remembering the last time, asks the boy, “How much?”\n\nBoy ~ “$750?\n\nMan ~ “Fine.”\n\nA few days later, the father says to the boy, “Grab your glove, let’s go outside and have a game of catch.”\n\nThe boy says, “I can’t, I sold my baseball and my glove.”\n\nThe father asks, “How much did you sell them for?”\n\nBoy ~ “$1,000?\n\nThe father says, “That’s terrible to overcharge your friends like that…that is way more than those two things cost. I’m going to take you to church and make you confess.”\n\nThey go to the church and the father makes the little boy sit in the confession booth and he closes the door.\n\nThe boy says, “Dark in here.”\n\nThe priest says, “Don’t start that crap again.”.",
      "title": "A woman is having an affair during the day while her husband is at work",
      "score": 37334,
      "subreddit": "jokes",
      "commentCount": 94,
      "url": "https://www.reddit.com/r/Jokes/comments/786v2d/a_woman_is_having_an_affair_during_the_day_while/",
      "tags": "A woman is having an affair during the day while her husband is at work \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "I was passing by my son's bedroom and was astonished to see the bed was nicely made and everything was picked up. Then, I saw an envelope, propped up prominently on the pillow, addressed to, 'Dad'. With the worst premonition, I opened the envelope and read the letter, with trembling hands.... \n\n\"Dear, Dad.\n\nIt is with great regret and sorrow that I'm writing you.\n\nI had to elope with my new girlfriend, because I wanted to avoid a scene with Mom and you.\n\nI've been finding real passion with Stacy.\n\nShe is so nice, but I knew you would not approve of her because of all her piercing's, tattoos, her tight motorcycle clothes and because she is so much older than I am.\n\nBut it's not only the passion, Dad.\n\nShe's pregnant.\n\nStacy said that we will be very happy.\n\nShe owns a trailer in the woods, and has a stack of firewood for the whole winter.\n\nWe share a dream of having many more children.\n\nStacy has opened my eyes to the fact that marijuana doesn't really hurt anyone.\n\nWe'll be growing it for ourselves and trading it with the other people in the commune for all the cocaine and ecstasy we want.\n\nIn the meantime, we'll pray that science will find a cure for AIDS so that Stacy can get better.\n\nShe sure deserves it!\n\nDon't worry Dad, I'm 15, and I know how to take care of myself.\n\nSomeday, I'm sure we'll be back to visit so you can get to know your many grandchildren.\n\nLove, your son, Joshua.\n\nP.S. Dad, none of the above is true.\n\nI'm over at Jason's house.\n\nI just wanted to remind you that there are worse things in life than the school report that's on the kitchen table.\n\nCall when it is safe for me to come home!\".",
      "title": "I was passing by my son's bedroom and was astonished to see the bed was nicely made and everything was picked up. Then, I saw an envelope, propped up prominently on the pillow, addressed to, 'Dad'. With the worst premonition, I opened the envelope and read the letter, with trembling hands...",
      "score": 32932,
      "subreddit": "jokes",
      "commentCount": 202,
      "url": "https://www.reddit.com/r/Jokes/comments/a3yk03/i_was_passing_by_my_sons_bedroom_and_was/",
      "tags": "I was passing by my son's bedroom and was astonished to see the bed was nicely made and everything was picked up. Then, I saw an envelope, propped up prominently on the pillow, addressed to, 'Dad'. With the worst premonition, I opened the envelope and read the letter, with trembling hands... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "I was talking to a scammer the other day..  Me: “Hello.”\n\nNOT-Microsoft support: “Hello. This is Bob Bobson from Microsoft Support. We are seeing a lot of virus activity from your device.”\n\nMe: “Oh no. My device? Are you sure?”\n\nNOT-Microsoft support: “Oh yes, we have many reports.”\n\nMe: “Oh jeez. How can I fix it?”\n\nNOT-Microsoft support: “It’s OK sir. We can help you right now. Are you in front of your device sir?”\n\nMe: “Yes. I was just about to use it. I’m glad you called.”\n\nNOT-Microsoft support: “Yes sir, we are going to help you. Can you please push the Start button?”\n\nMe: “I think it's already on.”\n\nNOT-Microsoft support: “Okay, sir. Now you want to click on Control Panel.”\n\nMe: “I don’t see that.”\n\nNOT-Microsoft support: “Do you see a bunch of information above the Start button?”\n\nMe: “Yes.”\n\nNOT-Microsoft support: “That is your Control Panel.”\n\nMe: “Wow, I didn’t realize it had a name.”\n\nNOT-Microsoft support: “Yes sir, now press on Internet Options.”\n\nMe: “Yeah, I definitely don’t see any Internet options. I don’t think I purchased that feature. This is just a cheap one.”\n\nNOT-Microsoft support: “They all have the Internet sir. Press the Start button again.”\n\nMe: “OK, it’s the same as before.”\n\nNOT-Microsoft support: “That’s OK sir. We are going to restart your device. Can you please turn it off?”\n\nMe: “Ummm…I don’t know how. I’ve never turned it off. Since I bought it, it just kind of stays on all the time.”\n\nNOT-Microsoft support: “There must be an off button on your device. How do you stop it when it’s running?”\n\nMe: “In those cases, I usually press the big button.”\n\nNOT-Microsoft support: “OK sir. Please press that button.”\n\nMe: “Ok.”\n\nNOT-Microsoft support: “Is your device off?”\n\nMe: “No. The door popped open.”\n\nNOT-Microsoft support: “Door? Is there a disc inside the door?”\n\nMe: “No, there’s a burrito.”\n\nNOT-Microsoft support: “Why is there a burrito in your computer?”\n\nMe: “Computer? I thought you said this was microwave support.”.",
      "title": "I was talking to a scammer the other day.",
      "score": 31323,
      "subreddit": "jokes",
      "commentCount": 170,
      "url": "https://www.reddit.com/r/Jokes/comments/fh93cl/i_was_talking_to_a_scammer_the_other_day/",
      "tags": "I was talking to a scammer the other day. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "My dick is bigger in Texas too. A blind man visits Texas. When he gets to his hotel room, he feels the bed. “Wow, this bed is big!”\n\n“Everything is big in Texas,” says the bellhop.\n\nThe man heads downstairs to the bar, settles into a huge barstool and orders a beer. A mug is placed between his hands. “Wow these drinks are big!”\n\nThe bartender replies, “Everything is big in Texas.”\n\nAfter downing a few, the blind man asks where the bathroom is. “Second door to the right,” says the bartender.\n\nThe blind man heads for the bathroom but accidentally enters the third door, which leads to the swimming pool, and he falls in. Popping his head up from under the water and flailing his arms, he shouts, “Don’t flush, don’t flush!”.",
      "title": "My dick is bigger in Texas too",
      "score": 34546,
      "subreddit": "jokes",
      "commentCount": 99,
      "url": "https://www.reddit.com/r/Jokes/comments/icv4lu/my_dick_is_bigger_in_texas_too/",
      "tags": "My dick is bigger in Texas too \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A Mexican man who spoke no English went into a department store to buy socks.. He found his way to the menswear department where a young lady offered to help him.\n\n\"Quiero calcetines,\" said the man.\n\n\"I don't speak Spanish, but we have some very nice suits over here,\" said the salesgirl.\n\n\"No, no quiero trajes. Quiero calcetines,\" said the man.\n\n\"Well, these shirts are on sale this week,\" declared the salesgirl.\n\n\"No, no quiero camisas. Quiero calcetines,\" repeated the man.\n\n\"I still don't know what you're trying to say. We have some fine pants on this rack,\" offered the salesgirl.\n\n\"No, no quiero pantalones. Quiero calcetines,\" insisted the man.\n\n\"These sweaters are top quality,\" the salesgirl probed.\n\n\"No, no quiero sueter. Quiero calcetines,\" said the man.\n\n\"Our undershirts are over here,\" fumbled the salesgirl, beginning to lose patience.\n\n\"No, no quiero camisetas. Quiero calcetines,\" the man repeated.\n\nAs they passed the underwear counter, the man spotted a display of socks and happily grabbed a pair. Holding them up he proclaimed, \"Eso sí que es!\"\n\n\"Why didn't you just spell it in the first place?!\" yelled the salesgirl.\n\nedit: [credit for the joke](https://www.reddit.com/r/Jokes/comments/8c9cmw/a_mexican_man_who_spoke_no_english_went_into_a/).",
      "title": "A Mexican man who spoke no English went into a department store to buy socks.",
      "score": 45340,
      "subreddit": "jokes",
      "commentCount": 104,
      "url": "https://www.reddit.com/r/Jokes/comments/8c9cmw/a_mexican_man_who_spoke_no_english_went_into_a/",
      "tags": "A Mexican man who spoke no English went into a department store to buy socks. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A Chinese doctor cant find a job in a hospital in America, so he opens a clinic and puts a sign outside that reads \"GET TREATMENT FOR $20 - IF NOT CURED GET BACK $100.\". An American lawyer thinks this is a great opportunity to earn $100 and goes to the clinic.\n\nLawyer: \"I have lost my sense of taste.\"\n\nChinese: \"Nurse, bring medicine from box No. 14 and put 3 drops in patient's mouth.\"\n\nLawyer: \"Ugh. this is kerosene.\"\n\nChinese: \"Congrats, your sense of taste is restored. Give me my $20.\"\n\nThe annoyed lawyer goes back after a few days to try to recover his money.\n\nLawyer: \"I have lost my memory. I can’t remember anything.\"\n\nChinese: \"Nurse, bring medicine from box no. 14 and put 3 drops in his mouth.\"\n\nLawyer (annoyed): \"This is kerosene. You gave this to me last time for restoring my taste.\"\n\nChinese: \"Congrats. You got your memory back. Give me $20.\"\n\nThe fuming lawyer pays him, then comes back a week later determined to get back $100.\n\nLawyer: \"My eyesight has become very weak I cannot see at all.\"\n\nChinese: \"Well, I don't have any medicine for that, so take this $100.\"\n\nLawyer (staring at the note): \"But this is $20, not $100!”\n\nChinese: \"Congrats, your eyesight is restored. Give me $20\".",
      "title": "A Chinese doctor cant find a job in a hospital in America, so he opens a clinic and puts a sign outside that reads \"GET TREATMENT FOR $20 - IF NOT CURED GET BACK $100.\"",
      "score": 45777,
      "subreddit": "jokes",
      "commentCount": 160,
      "url": "https://www.reddit.com/r/Jokes/comments/k6gl5l/a_chinese_doctor_cant_find_a_job_in_a_hospital_in/",
      "tags": "A Chinese doctor cant find a job in a hospital in America, so he opens a clinic and puts a sign outside that reads \"GET TREATMENT FOR $20 - IF NOT CURED GET BACK $100.\" \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A reporter walks into a bar. A reporter walks into a bar in a small Louisiana town. He's been sent by his editor in the big city to get a human interest story, and so he walks up to some burly guy in overalls and offers him a drink in return for the story of the best day of his life.\n\n\"Best day? Well, that must've been the day that Old Man Jones asked me for help. You see, his pretty little wife had wandered out and gotten lost in the bayou. So we put together a search party and went looking for her. Just before sundown, we found her...\"\n\nThis is great, thinks the reporter.\n\n\".. and then we all fucked her. Best damn day of my life.\"\n\n\"Holy shit,\" yells the reporter, \"that's terrible. I can't print that. Here, have another drink, and tell me about the second-best day of your life.\"\n\n\"Second-best, huh? That might've been the day Jim Bob's prize hog broke out of its pen and got lost in the bayou. He was mighty attached to that hog, so we put together a search party and went looking. Just before sunset we found it. Then, we all fucked it. Not as great as Mrs. Jones, but pretty damn good.\"\n\n\"Damn it, man, I can't possibly print that story,\" says the reporter despairingly. He decides on a different tack. \"How about another drink, and you tell me about the worst day of your life?\"\n\nHillbilly's face falls. \"Worst day of my life? Well, that had to be the day I got lost in the bayou...\".",
      "title": "A reporter walks into a bar",
      "score": 33400,
      "subreddit": "jokes",
      "commentCount": 82,
      "url": "https://www.reddit.com/r/Jokes/comments/hf6s0x/a_reporter_walks_into_a_bar/",
      "tags": "A reporter walks into a bar \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A Mexican man who spoke no English went into a department store to buy socks.. He found his way to the menswear department where a young lady offered to help him.\n\n\"Quiero calcetines,\" said the man.\n\n\"I don't speak Spanish, but we have some very nice suits over here,\" said the salesgirl.\n\n\"No, no quiero trajes. Quiero calcetines,\" said the man.\n\n\"Well, these shirts are on sale this week,\" declared the salesgirl.\n\n\"No, no quiero camisas. Quiero calcetines,\" repeated the man.\n\n\"I still don't know what you're trying to say. We have some fine pants on this rack,\" offered the salesgirl.\n\n\"No, no quiero pantalones. Quiero calcetines,\" insisted the man.\n\n\"These sweaters are top quality,\" the salesgirl probed.\n\n\"No, no quiero sueter. Quiero calcetines,\" said the man.\n\n\"Our undershirts are over here,\" fumbled the salesgirl, beginning to lose patience.\n\n\"No, no quiero camisetas. Quiero calcetines,\" the man repeated.\n\nAs they passed the underwear counter, the man spotted a display of socks and happily grabbed a pair. Holding them up he proclaimed, \"Eso sí que es!\"\n\n\"Why didn't you just spell it in the first place?!\" yelled the salesgirl.\n\nedit: [credit for the joke](https://www.reddit.com/r/Jokes/comments/8c9cmw/a_mexican_man_who_spoke_no_english_went_into_a/).",
      "title": "A Mexican man who spoke no English went into a department store to buy socks.",
      "score": 45340,
      "subreddit": "jokes",
      "commentCount": 104,
      "url": "https://www.reddit.com/r/Jokes/comments/8c9cmw/a_mexican_man_who_spoke_no_english_went_into_a/",
      "tags": "A Mexican man who spoke no English went into a department store to buy socks. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "I want to try translating an Iraqi joke to English and see if it works. A man is sitting in a cafe.... A man is sitting in a cafe when suddenly someone he knows comes running to him in panic shouting \"Quick, your wife is cheating on you with your best friend in the forest\". The man runs out of the cafe angry and furious to see for himself and returns after a short while and sits back down on his chair. The people in the cafe and the guy that told him are confused and ask what happened. The man says \"this son of a bitch was just exaggerating, firstly, it was just a couple of trees he made it out like it was a forest, secondly, best friend he says?! It turns out I don't even know the guy\". Thank you\n\nEdit: Thank you kind stranger for my first gold. The people of Iraq thank you too..",
      "title": "I want to try translating an Iraqi joke to English and see if it works. A man is sitting in a cafe...",
      "score": 46002,
      "subreddit": "jokes",
      "commentCount": 148,
      "url": "https://www.reddit.com/r/Jokes/comments/hec80q/i_want_to_try_translating_an_iraqi_joke_to/",
      "tags": "I want to try translating an Iraqi joke to English and see if it works. A man is sitting in a cafe... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "I think, I'm going to lose my drivers license.... \nand all just because of a stupid police officer...\nThe conversation went like this, when I got pulled over in my car:\n\nOfficer: \"License and registration, please, I think you are drunk!\"\n\nMe: \"I assure you, I did not drink anything.\"\n\nOfficer: \"Ok, let's do a little test! Imagine driving in the dark on a highway at night, when you see two lights in the distance. What is this?\"\n\nMe: \"A car.\"\n\nOfficer:\"Of course! But which one? A Mercedes, an Audi or a Ford?\"\n\nMe:\"I have no idea!\"\n\nOfficer:\"So, you're drunk.\"\n\nMe:\"But I didn't drink anything.\"\n\nOfficer:\"Okay, one more test -- Imagine, you drive in the dark on a highway at night, and there is one light coming at you.What is it?\n\nMe:\"A motorcycle.\"\n\nOfficer:\"Of course! But which one? A Honda, a Kawasaki or a Harley?\"\n\nMe:\"I have no idea!\"\n\nOfficer:\"As I suspected, you're drunk!\"\n\nThen I started to get annoyed and asked a counter question.\n\nMe:\"So..., counter question -- You're driving in the dark on a highway at night and see a woman on the roadside. She wears a mini skirt, fishnet stockings, high heeled shoes and only a bra as a top. What is this?\"\n\nOfficer:\"A prostitute of course.\"\n\nMe:\"Yes, but which one? Your daughter, your wife or your mother?\"\n\nThings went downhill from there and now I have a court date to attend....",
      "title": "I think, I'm going to lose my drivers license...",
      "score": 33212,
      "subreddit": "jokes",
      "commentCount": 117,
      "url": "https://www.reddit.com/r/Jokes/comments/i2o3k6/i_think_im_going_to_lose_my_drivers_license/",
      "tags": "I think, I'm going to lose my drivers license... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A woman is at home when she hears someone knock at the door. She goes to the door and opens the door to see a man standing there.. He asks the lady, ‘Do you have a vagina?’\n\nShe slams the door in disgust.\n\nThe next morning she hears a knock at the door and it is the same man and he asks the same question of the woman, ‘Do you have a vagina’?\n\nShe slams the door again.\n\nLater that night when her husband gets home she tells him what has happened for the last two days.\n\nThe husband tells the wife in a loving and concerned voice, ‘Honey I am taking tomorrow off to be home just in case this guy shows up again’\n\nThe next morning they hear a knock at the door and both run for the door. The husband says to the wife in a whispered voice, ‘Honey, I’m going to hide behind the door and listen and if it is the same guy I want you to answer yes to the question, because I want to see where he is going with it’\n\nShe nods yes to her husband and opens the door.\n\nSure enough the same fellow is standing there and asks the same question. ‘Do you have a vagina’?\n\n‘Yes’ she says.\n\nThe man replied, ‘That’s great! Would you mind telling your husband to leave my wife’s alone and start using yours?’.",
      "title": "A woman is at home when she hears someone knock at the door. She goes to the door and opens the door to see a man standing there.",
      "score": 38692,
      "subreddit": "jokes",
      "commentCount": 95,
      "url": "https://www.reddit.com/r/Jokes/comments/elqq8w/a_woman_is_at_home_when_she_hears_someone_knock/",
      "tags": "A woman is at home when she hears someone knock at the door. She goes to the door and opens the door to see a man standing there. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "Iris‌‌h daughte‌‌r ha‌‌d no‌‌t bee‌‌n hom‌‌e fo‌‌r ove‌‌r ‌‌5 years‌‌. Upo‌‌n he‌‌r retur‌‌n he‌‌r Fathe‌‌r curse‌‌d he‌‌r heavily‌‌.. \"Wher‌‌e hav‌‌e y‌‌e bee‌‌n al‌‌l thi‌‌s time‌‌, child‌‌? Wh‌‌y di‌‌d y‌‌e no‌‌t writ‌‌e t‌‌o us‌‌, no‌‌t eve‌‌n ‌‌a line‌‌? Wh‌‌y didn'‌‌t y‌‌e call‌‌? Ca‌‌n y‌‌e no‌‌t understan‌‌d wha‌‌t y‌‌e pu‌‌t ye‌‌r ol‌‌d Mothe‌‌r through?‌‌\"  \n‌‌  \nTh‌‌e girl‌‌, crying‌‌, replied‌‌, \"Dad..‌‌. ‌‌I becam‌‌e ‌‌a prostitute.‌‌\"  \n‌‌  \n\"Y‌‌e what!‌‌? Ge‌‌t ou‌‌t ‌‌a here‌‌, y‌‌e shameles‌‌s harlot‌‌! Sinner‌‌! You'r‌‌e ‌‌a disgrac‌‌e t‌‌o thi‌‌s Catholi‌‌c family.‌‌\"  \n‌‌  \n\"OK‌‌, Dad..‌‌. a‌‌s y‌‌e wish‌‌. ‌‌I onl‌‌y cam‌‌e bac‌‌k t‌‌o giv‌‌e mu‌‌m thi‌‌s luxuriou‌‌s fu‌‌r coat‌‌, titl‌‌e dee‌‌d t‌‌o ‌‌a te‌‌n bedroo‌‌m mansion‌‌, plu‌‌s ‌‌a ‌‌5 millio‌‌n saving‌‌s certificate‌‌. Fo‌‌r m‌‌e littl‌‌e brother‌‌, thi‌‌s gol‌‌d Rolex‌‌. An‌‌d fo‌‌r y‌‌e Daddy‌‌, th‌‌e sparklin‌‌g ne‌‌w Mercede‌‌s limite‌‌d editio‌‌n convertibl‌‌e that'‌‌s parke‌‌d outsid‌‌e plu‌‌s ‌‌a membershi‌‌p t‌‌o th‌‌e countr‌‌y clu‌‌b ..‌‌. (take‌‌s ‌‌a breath‌‌) ..‌‌. an‌‌d a‌‌n invitatio‌‌n fo‌‌r y‌‌e al‌‌l t‌‌o spen‌‌d Ne‌‌w Year'‌‌s Ev‌‌e o‌‌n boar‌‌d m‌‌y ne‌‌w yach‌‌t i‌‌n th‌‌e Riviera.‌‌\"  \n‌‌  \n\"Wha‌‌t wa‌‌s i‌‌t y‌‌e sai‌‌d y‌‌e ha‌‌d become?\"‌‌, say‌‌s Dad‌‌.  \n‌‌  \nGirl‌‌, cryin‌‌g again‌‌, \"‌‌A prostitute‌‌, Daddy!‌‌\"  \n‌‌  \n\"Oh‌‌! M‌‌y Goodness‌‌! Y‌‌e scare‌‌d m‌‌e hal‌‌f t‌‌o death‌‌, girl‌‌! ‌‌I though‌‌t y‌‌e sai‌‌d ‌‌a Protestant‌‌! Com‌‌e her‌‌e an‌‌d giv‌‌e ye‌‌r ol‌‌d Da‌‌d ‌‌a hug!‌‌\".",
      "title": "Iris‌‌h daughte‌‌r ha‌‌d no‌‌t bee‌‌n hom‌‌e fo‌‌r ove‌‌r ‌‌5 years‌‌. Upo‌‌n he‌‌r retur‌‌n he‌‌r Fathe‌‌r curse‌‌d he‌‌r heavily‌‌.",
      "score": 88701,
      "subreddit": "jokes",
      "commentCount": 93,
      "url": "https://www.reddit.com/r/Jokes/comments/hy6v4c/irish_daughter_had_not_been_home_for_over_5_years/",
      "tags": "Iris‌‌h daughte‌‌r ha‌‌d no‌‌t bee‌‌n hom‌‌e fo‌‌r ove‌‌r ‌‌5 years‌‌. Upo‌‌n he‌‌r retur‌‌n he‌‌r Fathe‌‌r curse‌‌d he‌‌r heavily‌‌. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "I want to try translating an Iraqi joke to English and see if it works. A man is sitting in a cafe.... A man is sitting in a cafe when suddenly someone he knows comes running to him in panic shouting \"Quick, your wife is cheating on you with your best friend in the forest\". The man runs out of the cafe angry and furious to see for himself and returns after a short while and sits back down on his chair. The people in the cafe and the guy that told him are confused and ask what happened. The man says \"this son of a bitch was just exaggerating, firstly, it was just a couple of trees he made it out like it was a forest, secondly, best friend he says?! It turns out I don't even know the guy\". Thank you\n\nEdit: Thank you kind stranger for my first gold. The people of Iraq thank you too..",
      "title": "I want to try translating an Iraqi joke to English and see if it works. A man is sitting in a cafe...",
      "score": 46010,
      "subreddit": "jokes",
      "commentCount": 148,
      "url": "https://www.reddit.com/r/Jokes/comments/hec80q/i_want_to_try_translating_an_iraqi_joke_to/",
      "tags": "I want to try translating an Iraqi joke to English and see if it works. A man is sitting in a cafe... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "In a crowded city at a bus stop, a beautiful young woman was waiting for the bus. She was decked out in a tight leather mini skirt, with matching tight leather boots and jacket.... \n\nAs the bus rolled up and it became her turn to get on, she became aware that her skirt was too tight to allow her leg to come up to the height of the first step on the bus.\n\n Slightly embarrassed and with a quick smile to the bus driver, she reached behind and unzipped her skirt a little, thinking that this would give her enough slack to raise her leg. \n\nAgain, she tried to make the step onto the bus, only to discover she still couldn't! \n\nSo, a little more embarrassed, she once again reached behind and unzipped her skirt a little more and for a second time attempted the step and once again, still she could not raise her leg because of the tight skirt. \n\nWith a coy little smile to the driver, she again unzipped the offending skirt to give a little more slack and again was unable to make the step.\n\nAbout this time, a big Texan that was behind her in the line picked her up easily from the waist and placed her lightly on the step of the bus. \n\nWell, she went ballistic and turned on the would-be hero screeching at him, \"How dare you touch my body!! I don't even know who you are!\"\n\nAt this, the Texan drawled, \"Well ma'am normally I would agree with you, but after you unzipped my fly three times, I kinda figured that we was friends.\".",
      "title": "In a crowded city at a bus stop, a beautiful young woman was waiting for the bus. She was decked out in a tight leather mini skirt, with matching tight leather boots and jacket...",
      "score": 32595,
      "subreddit": "jokes",
      "commentCount": 86,
      "url": "https://www.reddit.com/r/Jokes/comments/8a8jji/in_a_crowded_city_at_a_bus_stop_a_beautiful_young/",
      "tags": "In a crowded city at a bus stop, a beautiful young woman was waiting for the bus. She was decked out in a tight leather mini skirt, with matching tight leather boots and jacket... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "Two Texas farmers, Jim and Bob are sitting in a bar, enjoying beers.. Jim turns to Bob, and says, \"You know what, I'm going to go to college!\" He then leaves the bar and makes his way over to the local college. He is met with the Dean of Administration, who is explaining to Jim what classes he is going to take. \n\n\"Alright, Jim. You are going to take 4 classes,\" the Dean says. \"English, Math, Science, and Logic.\"\n\n\"Logic?\" Jim asks. \"What the hell is that?\"\n\n\"Here, I'll give you an example. Do you own a weed wacker?\"\n\nProudly, Jim responded, \"Yes, I do.\"\n\n\"Well, if you own a weed wacker, then logically speaking you own a lawn,\" the Dean said.\n\n\"Yes, yes I do have a lawn!\"\n\n\"Well, if you have a lawn, then logically speaking you own a house.\"\n\n\"Yes, yes I do have a house!\"\n\n\"And if you have a house, then logically speaking you have a family.\"  \n\n\n\"Yes, yes I do have a family!\"\n\n\"And if you have a family, then logically speaking you have a wife. And if you have a wife, then logically speaking you're heterosexual.\"\n\n\"Yes, yes I do have a wife and I am heterosexual! Wow, I can't believe you found out all of that just because you knew I had a weed wacker!\" Jim exclaimed.\n\n\"Yeah, that's what logic is,\" the Dean responded. Jim excitedly went back to the bar, awaited by Bob. \n\n\"Bob, I'm taking 4 classes in college. English, Math, Science, and Logic,\" Jim told Bob.\n\n\"Logic?\" Bob asks. \"What the hell is that?\"\n\n\"Here, I'll give you an example. Do you own a weed wacker?\"\n\n\"No.\"\n\n\"Then you're gay.\".",
      "title": "Two Texas farmers, Jim and Bob are sitting in a bar, enjoying beers.",
      "score": 36477,
      "subreddit": "jokes",
      "commentCount": 137,
      "url": "https://www.reddit.com/r/Jokes/comments/8vojb7/two_texas_farmers_jim_and_bob_are_sitting_in_a/",
      "tags": "Two Texas farmers, Jim and Bob are sitting in a bar, enjoying beers. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A man playing on a new golf course got confused as to what hole he was on. He saw a lady playing ahead of him, so he walked up to her and asked if she knew what hole he was playing.... \nShe replied, “I’m on the 7th hole and you’re a hole behind me, so you must be on the 6th hole.”\n\nHe thanked her and went back to his golf.\n\nOn the back nine, the same thing happened and he approached the lady, again with the same request.\n\nShe said, “I’m on the 14th, you are a hole behind me, so you must be on the 13th.”\n\nOnce again, he thanked her.\n\nHe finished his round, went into the club house and saw the lady sitting at the end of the bar.\n\nHe went up to her and said, “Let me buy you a drink to show my appreciation for your help.”\n\nHe started a conversation and asked her what kind of work she did.\n\nShe said she was in sales and he said he was in sales also. \n\nHe asked what she sold.\n\nShe replied, “If I told you, you would only laugh.”\n\n“No, I wouldn’t.” he said.\n\nShe said, “I sell tampons.”\n\nWith that he fell on the floor laughing so hard.\n\nShe said, “See, I knew you would laugh.”\n\n“That’s not what I’m laughing at!” he replied. “I’m a toilet paper salesman, so I’m STILL one hole behind you!”.",
      "title": "A man playing on a new golf course got confused as to what hole he was on. He saw a lady playing ahead of him, so he walked up to her and asked if she knew what hole he was playing...",
      "score": 48491,
      "subreddit": "jokes",
      "commentCount": 158,
      "url": "https://www.reddit.com/r/Jokes/comments/if1pvo/a_man_playing_on_a_new_golf_course_got_confused/",
      "tags": "A man playing on a new golf course got confused as to what hole he was on. He saw a lady playing ahead of him, so he walked up to her and asked if she knew what hole he was playing... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "In an African tribe village, the chieftain's wife gave birth to a white skinned child.. The chieftain quickly figured the voluntary doctor from Europe might be to blame. So the chieftain asked him to talk in his tent. \n\nChieftain: \"Today my wife gave birth to a white child. She and I are dark skinned. You are white. It doesn't take a doctor to figure out that you have slept with my wife!\"\n\nThe doctor remains calm: \"The answer lies in the genetics. Some genetics have recessive traits, which are not apparent to the parents but may be passed on to the child. For example, last week one of your sheep gave birth to a black sheep.\" \n\nThe chieftain pauses for a thinking, then replies: \"I tell you what. You say no word about black sheep and I say no word about white child.\".",
      "title": "In an African tribe village, the chieftain's wife gave birth to a white skinned child.",
      "score": 31821,
      "subreddit": "jokes",
      "commentCount": 112,
      "url": "https://www.reddit.com/r/Jokes/comments/d6sb9a/in_an_african_tribe_village_the_chieftains_wife/",
      "tags": "In an African tribe village, the chieftain's wife gave birth to a white skinned child. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A‌‌n America‌‌n soldier‌‌, servin‌‌g i‌‌n Worl‌‌d Wa‌‌r I‌‌I ha‌‌d jus‌‌t returne‌‌d fro‌‌m severa‌‌l week‌‌s o‌‌f battl‌‌e o‌‌n th‌‌e Germa‌‌n fron‌‌t lines.. Th‌‌e soldie‌‌r ha‌‌d bee‌‌n grante‌‌d res‌‌t an‌‌d relaxatio‌‌n an‌‌d wa‌‌s o‌‌n ‌‌a trai‌‌n tha‌‌t wa‌‌s boun‌‌d fo‌‌r London.\n\nTh‌‌e trai‌‌n wa‌‌s ver‌‌y crowded‌‌, s‌‌o th‌‌e soldie‌‌r walke‌‌d th‌‌e lengt‌‌h o‌‌f th‌‌e trai‌‌n i‌‌n hope‌‌s o‌‌f findin‌‌g a‌‌n empt‌‌y seat.\n\nTh‌‌e onl‌‌y empt‌‌y sea‌‌t wa‌‌s directl‌‌y adjacen‌‌t t‌‌o ‌‌a wel‌‌l dresse‌‌d middl‌‌e age‌‌d Englis‌‌h lad‌‌y an‌‌d wa‌‌s bein‌‌g use‌‌d b‌‌y he‌‌r littl‌‌e dog.\n\nTh‌‌e wear‌‌y soldie‌‌r asked‌‌, \"Pleas‌‌e ma'am‌‌, ma‌‌y ‌‌I si‌‌t i‌‌n tha‌‌t seat?\"\n\nTh‌‌e Englis‌‌h woma‌‌n looke‌‌d dow‌‌n he‌‌r nos‌‌e a‌‌t th‌‌e solide‌‌r an‌‌d sniffe‌‌d the‌‌n said‌‌, \"Yo‌‌u Americans‌‌. Yo‌‌u ar‌‌e suc‌‌h ‌‌a rud‌‌e clas‌‌s o‌‌f people‌‌. Can'‌‌t yo‌‌u se‌‌e tha‌‌t m‌‌y littl‌‌e pooc‌‌h i‌‌s usin‌‌g tha‌‌t seat?\"\n\nTh‌‌e soldie‌‌r walke‌‌d away‌‌, lookin‌‌g i‌‌f ther‌‌e wer‌‌e an‌‌y othe‌‌r unoccupie‌‌d seat‌‌s t‌‌o use‌‌, bu‌‌t afte‌‌r anothe‌‌r tri‌‌p dow‌‌n t‌‌o th‌‌e en‌‌d o‌‌f th‌‌e train‌‌, h‌‌e foun‌‌d himsel‌‌f facin‌‌g th‌‌e woma‌‌n wit‌‌h th‌‌e do‌‌g again.\n\nAgain‌‌, th‌‌e soldie‌‌r asked‌‌, \"Pleas‌‌e lady‌‌. Ma‌‌y ‌‌I si‌‌t there‌‌? I'‌‌m ver‌‌y tired.\"\n\nTh‌‌e Englis‌‌h woma‌‌n wrinkle‌‌d he‌‌r nos‌‌e an‌‌d snorte‌‌d ou‌‌t loud‌‌, \"Yo‌‌u Americans‌‌! No‌‌t onl‌‌y ar‌‌e yo‌‌u rude‌‌, yo‌‌u ar‌‌e als‌‌o extremel‌‌y arrogant!\"\n\nTh‌‌e soldie‌‌r didn'‌‌t sa‌‌y anythin‌‌g else‌‌; h‌‌e leane‌‌d over‌‌, picke‌‌d u‌‌p th‌‌e littl‌‌e do‌‌g an‌‌d tosse‌‌d i‌‌t ou‌‌t th‌‌e windo‌‌w o‌‌f th‌‌e trai‌‌n an‌‌d sa‌‌t dow‌‌n i‌‌n th‌‌e empt‌‌y seat.\n\nTh‌‌e Woman‌‌, a‌‌t ‌‌a los‌‌s fo‌‌r words‌‌; shrieked‌‌, raile‌‌d an‌‌d demande‌‌d tha‌‌t someon‌‌e defen‌‌d he‌‌r an‌‌d chastis‌‌e th‌‌e soldier.\n\nA‌‌n Englis‌‌h gentleme‌‌n sittin‌‌g acros‌‌s th‌‌e aisl‌‌e spok‌‌e u‌‌p an‌‌d said‌‌, \"Yo‌‌u know‌‌, sir‌‌, yo‌‌u American‌‌s d‌‌o see‌‌m t‌‌o hav‌‌e ‌‌a penchan‌‌t fo‌‌r doin‌‌g th‌‌e wron‌‌g thing‌‌. Yo‌‌u ea‌‌t holdin‌‌g th‌‌e for‌‌k i‌‌n th‌‌e wron‌‌g hand‌‌, yo‌‌u driv‌‌e you‌‌r auto‌‌s o‌‌n th‌‌e wron‌‌g sid‌‌e o‌‌f th‌‌e roa‌‌d an‌‌d now‌‌, sir‌‌, you'v‌‌e throw‌‌n th‌‌e wron‌‌g bitc‌‌h ou‌‌t th‌‌e window!.\".",
      "title": "A‌‌n America‌‌n soldier‌‌, servin‌‌g i‌‌n Worl‌‌d Wa‌‌r I‌‌I ha‌‌d jus‌‌t returne‌‌d fro‌‌m severa‌‌l week‌‌s o‌‌f battl‌‌e o‌‌n th‌‌e Germa‌‌n fron‌‌t lines.",
      "score": 34171,
      "subreddit": "jokes",
      "commentCount": 95,
      "url": "https://www.reddit.com/r/Jokes/comments/gtziph/an_american_soldier_serving_in_world_war_ii_had/",
      "tags": "A‌‌n America‌‌n soldier‌‌, servin‌‌g i‌‌n Worl‌‌d Wa‌‌r I‌‌I ha‌‌d jus‌‌t returne‌‌d fro‌‌m severa‌‌l week‌‌s o‌‌f battl‌‌e o‌‌n th‌‌e Germa‌‌n fron‌‌t lines. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A husband notices his wife’s hearing is deteriorating and decides to visit her doctor for advice.. “I can’t speak to my wife directly as she might find it offensive, given our old age” he says to the doc.\n\n“There’s a simple trick you can try to determine her hearing” explains the doctor. “Simply ask her a question at a distance and if she doesn’t hear you, move slightly closer and ask again until she does”.\n\nThat night, the husband arrives home and sees his wife in the kitchen cooking. He thinks to himself, “what a perfect opportunity to test her hearing”.\n\nHe stands in the doorway of the kitchen and promptly asks;\n\n“What’s for dinner honey?”\n\nNo answer. He moves closer.\n\n“What’s for dinner honey?”\n\nStill no answer. He moves even closer.\n\n“What’s for dinner honey?”\n\nStill his wife doesn’t answer. He now sees how serious her hearing problem is. At this point, he is stood right next to his wife.\n\n“What’s for dinner honey?”\n\n“FOR THE FOURTH FUCKING TIME WE’RE HAVING CHICKEN”.",
      "title": "A husband notices his wife’s hearing is deteriorating and decides to visit her doctor for advice.",
      "score": 39578,
      "subreddit": "jokes",
      "commentCount": 148,
      "url": "https://www.reddit.com/r/Jokes/comments/bdwmqr/a_husband_notices_his_wifes_hearing_is/",
      "tags": "A husband notices his wife’s hearing is deteriorating and decides to visit her doctor for advice. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "An 18 year old girl tells her mom that she has missed her last 2 periods.  \n\nVery worried, the mother goes to the drugstore and buys a pregnancy test. The test result shows that the girl is pregnant. Crying, cursing and Shouting the mother says, \"Who was the bastard that did this to you? I want to know!\"\n\nThe girl picks up the phone and makes a call. Half an hour later, a Rolls-Royce stops in front of their house. A mature and distinguished man with gray hair and impeccably dressed in an Armani suit steps out of the of the Royce and enters the house. He sits in the living room with the father, mother, and the girl and tells them: \"Good morning, your daughter has informed me of the problem. I can't marry her because of my personal family situation but I'll take care of it.\"\n\n\"I will pay all costs and provide for your daughter for the rest of her life.\" \"Additionally, if a girl is born, I will bequeath a Royce, a mansion, two retail stores, a townhouse, a beachfront villa, and a $2,000,000 bank account. If a boy is born, my legacy will be a couple of factories and a $4,000,000 bank account. If twins, they will receive a factory and $2,000,000 each. However, if there is a miscarriage, what do you suggest I do?\"\n\nAt this point, the father, who had remained silent, places a hand menacingly on the man's shoulder and tells him, \"You fuck her again.\".",
      "title": "An 18 year old girl tells her mom that she has missed her last 2 periods",
      "score": 31750,
      "subreddit": "jokes",
      "commentCount": 79,
      "url": "https://www.reddit.com/r/Jokes/comments/iz3dgj/an_18_year_old_girl_tells_her_mom_that_she_has/",
      "tags": "An 18 year old girl tells her mom that she has missed her last 2 periods \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A lost dog strays into a jungle. A lion sees this from a distance and says with caution \"this guy looks edible, never seen his kind before\".. So the lion starts rushing towards the dog with menace. The dog notices and starts to panic but as he's about to run he sees some bones next to him and gets an idea and says loudly \"mmm...that was some good lion meat!\". \n\nThe lion abruptly stops and says \" woah! This guy seems tougher then he looks, I better leave while I can\". \n\nOver by the tree top, a monkey witnessed everything. Evidently, the monkey realizes the he can benefit from this situation by telling the lion and getting something in return. So the monkey proceeds to tell the lion what really happened and the lion says angrily \"get on my back, we'll get him together\". \n\nSo they start rushing back to the dog. The dog sees them and realized what happened and starts to panic even more. He then gets another idea and shouts \"where the hell is that monkey! I told him to bring me another lion an hour ago...\"\n\nEdit: OMG my first gold! Thank you!.",
      "title": "A lost dog strays into a jungle. A lion sees this from a distance and says with caution \"this guy looks edible, never seen his kind before\".",
      "score": 64218,
      "subreddit": "jokes",
      "commentCount": 76,
      "url": "https://www.reddit.com/r/Jokes/comments/8vx7ym/a_lost_dog_strays_into_a_jungle_a_lion_sees_this/",
      "tags": "A lost dog strays into a jungle. A lion sees this from a distance and says with caution \"this guy looks edible, never seen his kind before\". \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A guy walks into the bar of a restaurant. He goes to the bartender and asks \"how much for a beer?\" The bartender replies \"$1\". The customer completely amazed, orders a beer then asks the bartender \"Well then how much for a NY sirloin, with side of mashed potatoes and salad, and an entire cheesecake for desert?\" The Bartender reply's \"$5\".\n\n The guy still amazed then orders everything and after he is done eating his meal then says \"Wow, this place is amazing, I really wish I could meet the owner of this place\". The bartender then says \"Oh well, he's upstairs in his office with my wife\". \n\nThe guy looks all confused then asks \"What is he doing upstairs in his office with your wife?\" The bartender then says \"The same thing I'm doing to his business\"..",
      "title": "A guy walks into the bar of a restaurant",
      "score": 32013,
      "subreddit": "jokes",
      "commentCount": 100,
      "url": "https://www.reddit.com/r/Jokes/comments/ia5f4u/a_guy_walks_into_the_bar_of_a_restaurant/",
      "tags": "A guy walks into the bar of a restaurant \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "Two rednecks flew to Canada on a hunting trip..   \n\n They chartered a small plane to take them into the Rockies for a week hunting moose.   \n \n\nThey managed to bag 6. As they were loading the plane to return, the Pilot said the plane could take only 4 moose.   \n \n\nThe two guys objected strongly. \"Last year we shot six. The pilot let us take them all and he had the same plane as yours.\"   \n \n\nReluctantly, the pilot gave in and all six were loaded. The plane took  off. However, while attempting to cross some mountains, even on full power, the little plane couldn't handle the load and went down.   \n \n\nSomehow, surrounded by the moose bodies, only the two rednecks survived the   \n crash.   \n \n\nAfter climbing out of the wreckage, Billy Ray asked Billy Bob, \"Any idea where we   \n are?\"   \n \n\nBilly Bob replied, \"I think we're pretty close to where we crashed last year.\".",
      "title": "Two rednecks flew to Canada on a hunting trip.",
      "score": 39715,
      "subreddit": "jokes",
      "commentCount": 102,
      "url": "https://www.reddit.com/r/Jokes/comments/ao79t3/two_rednecks_flew_to_canada_on_a_hunting_trip/",
      "tags": "Two rednecks flew to Canada on a hunting trip. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A Hindu, a Rabbi, and a Jehovah's Witness are lost... They wander across a farmstead and ask to spend the night.\n\n\"I only have room for two, so one of you will have to stay in the barn,\" says the Farm Owner.\n\nThe Hindu immediately volunteers, insisting it's no problem. However, a few minutes later, he knocks on the front door.\n\n\"I'm sorry, but there is a cow in the barn, and they are sacred to me.\"\n\n\"No problem,\" says the Rabbi, and he goes to the barn. Again though, he returns and knocks. \"There is also a pig in there, and that is against our teachings.\"\n\n\"I will go then, friends,\" says the Jehovah's Witness, and he proceeds to the barn. A few moments later, there is a knock at the door. It's the cow and the pig..",
      "title": "A Hindu, a Rabbi, and a Jehovah's Witness are lost..",
      "score": 33209,
      "subreddit": "jokes",
      "commentCount": 101,
      "url": "https://www.reddit.com/r/Jokes/comments/9rci6a/a_hindu_a_rabbi_and_a_jehovahs_witness_are_lost/",
      "tags": "A Hindu, a Rabbi, and a Jehovah's Witness are lost.. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "I think, I'm going to lose my drivers license.... \nand all just because of a stupid police officer...\nThe conversation went like this, when I got pulled over in my car:\n\nOfficer: \"License and registration, please, I think you are drunk!\"\n\nMe: \"I assure you, I did not drink anything.\"\n\nOfficer: \"Ok, let's do a little test! Imagine driving in the dark on a highway at night, when you see two lights in the distance. What is this?\"\n\nMe: \"A car.\"\n\nOfficer:\"Of course! But which one? A Mercedes, an Audi or a Ford?\"\n\nMe:\"I have no idea!\"\n\nOfficer:\"So, you're drunk.\"\n\nMe:\"But I didn't drink anything.\"\n\nOfficer:\"Okay, one more test -- Imagine, you drive in the dark on a highway at night, and there is one light coming at you.What is it?\n\nMe:\"A motorcycle.\"\n\nOfficer:\"Of course! But which one? A Honda, a Kawasaki or a Harley?\"\n\nMe:\"I have no idea!\"\n\nOfficer:\"As I suspected, you're drunk!\"\n\nThen I started to get annoyed and asked a counter question.\n\nMe:\"So..., counter question -- You're driving in the dark on a highway at night and see a woman on the roadside. She wears a mini skirt, fishnet stockings, high heeled shoes and only a bra as a top. What is this?\"\n\nOfficer:\"A prostitute of course.\"\n\nMe:\"Yes, but which one? Your daughter, your wife or your mother?\"\n\nThings went downhill from there and now I have a court date to attend....",
      "title": "I think, I'm going to lose my drivers license...",
      "score": 33217,
      "subreddit": "jokes",
      "commentCount": 117,
      "url": "https://www.reddit.com/r/Jokes/comments/i2o3k6/i_think_im_going_to_lose_my_drivers_license/",
      "tags": "I think, I'm going to lose my drivers license... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A lady approaches a priest and shyly tells him, \"Father, I have a problem. I have these two talking female parrots but, they only know how to say one thing... they keep saying 'Hi, we’re hot... do you want to *fuck us*?'\". \"That's terrible!\" says the priest. \"But, I have a solution to your problem. Bring your two parrots over to my house tomorrow. I will put them with my two male talking parrots... to whom I've taught to pray and read the bible. My parrots will then teach your parrots to stop saying that terrible filth, and your female parrots will learn to pray and worship the good Lord.\" So the next day, the lady brings her two female parrots to the priest's house. The priest's two male parrots are holding rosary beads and praying in their cage. The lady puts her female talking parrots in with the male talking Parrots, and the female parrots say, \"Hi, we're hot. Do you want to fuck us?” One male parrot looks over at the other male parrot and screams, \"put the bible away you idiot, our prayers have been answered!\"\n\n**EDIT: Thanks a lot to** u/Green_Justice710 **and the 5 anonymous redittors who have awarded me for this... thank you! I'm glad I could make you guys laugh!!**\n\n**EDIT 2: Thanks also to** u/darknep u/JMetcalf3 **and 5 other anonymous posters... you're too kind!! Thank you!**\n\n**EDIT 3: Just spent the last hour reading up on all the comments and appreciation... this thing really blew up, huh??? Well, you know what that means right?? More Edits, lol... thanks to u**[**/BlackBeard\\_727**](https://www.reddit.com/user/BlackBeard_727) **u**[**/Hirsty\\_92**](https://www.reddit.com/user/Hirsty_92) **u**[**/Cparman9**](https://www.reddit.com/user/Cparman9) **u/**[**WeHaSaulFan**](https://www.reddit.com/user/WeHaSaulFan) **u**[**/Serg2778**](https://www.reddit.com/user/Serg2778) **u/**[**Official\\_Vsauce**](https://www.reddit.com/user/Official_Vsauce) **u**[**/Jocombs**](https://www.reddit.com/user/Jocombs) **u/**[**throwRAnoitsmydog**](https://www.reddit.com/user/throwRAnoitsmydog) **u**[**/walmartlifer**](https://www.reddit.com/user/walmartlifer) **u/**[**GregHawkwind**](https://www.reddit.com/user/GregHawkwind) **u/**[**OneBraveBunny**](https://www.reddit.com/user/OneBraveBunny) **u**[**/reddit\\_guy88**](https://www.reddit.com/u/reddit_guy88) **u/**[**PolarJumper**](https://www.reddit.com/user/PolarJumper) **u/**[**NetworkMick**](https://www.reddit.com/user/NetworkMick) **and the multiple anonymous redditors as well. Glad I could tickle your funny bones!! (;**.",
      "title": "A lady approaches a priest and shyly tells him, \"Father, I have a problem. I have these two talking female parrots but, they only know how to say one thing... they keep saying 'Hi, we’re hot... do you want to *fuck us*?'\"",
      "score": 56477,
      "subreddit": "jokes",
      "commentCount": 115,
      "url": "https://www.reddit.com/r/Jokes/comments/gqexpm/a_lady_approaches_a_priest_and_shyly_tells_him/",
      "tags": "A lady approaches a priest and shyly tells him, \"Father, I have a problem. I have these two talking female parrots but, they only know how to say one thing... they keep saying 'Hi, we’re hot... do you want to *fuck us*?'\" \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "Son: \"Daddy, I fell in love and want to date this awesome girl.\". Father: \"That's great, son! Who is she?\"\n\nSon: \"It's Sandra, the neighbor's daughter.\"\n\nFather: \"Ohhh, I wish you hadn't said that. I have to tell you something, son, but you must promise not to tell your mother. Sandra is actually your sister.\"\n\nThe boy is naturally bummed out, but a couple of months later:\n\nSon: \"Daddy, I fell in love again and she is even hotter!\"\n\nFather: \"That's great, son! Who is she?\"\n\nSon: \"It's Angela, the other neighbor's daughter.\"\n\nFather: \"Ohhh, I wish you hadn't said that. Angela is also your sister.\"\n\nThis went on a few more times, and finally the son was so mad, he went straight to his mother crying.\n\nSon: \"Mom, I am so mad at dad! I fell in love with six girls and I can't date any of them because dad is their father!\"\n\nThe mother hugs him affectionately and says, \"You can date whoever you want. He isn't your father!\".",
      "title": "Son: \"Daddy, I fell in love and want to date this awesome girl.\"",
      "score": 39655,
      "subreddit": "jokes",
      "commentCount": 125,
      "url": "https://www.reddit.com/r/Jokes/comments/6ummra/son_daddy_i_fell_in_love_and_want_to_date_this/",
      "tags": "Son: \"Daddy, I fell in love and want to date this awesome girl.\" \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A man finds out his wife is cheating on him.... So he walks into a bar.\n\nThe bartender asks \"Why are you looking so blue?\"\n\nThe man replies \"I just found out my wife is cheating on me. I've decided I'm going to drink myself to death. I'll have some whiskey please.\"\n\nThe bartender looks shocked and says \"I'm sorry, but I can't help you kill yourself.\"\n\nThe man asks \"Well what would you do in my situation?\"\n\nThe bartender thinks for a bit and says \"If I found out a guy was sleeping with my wife I wouldn't sit around feeling sorry for myself, I'd kill the guy.\"\n\nThe man jumps up from his stool and shouts \"That's a great idea! Thanks!\" and runs out of the bar.\n\nA couple hours goes by and the bartender is starting to get nervous. Suddenly the man walks back into the bar with a big smile on his face.\n\n\"Did you kill the guy?\" The bartender asks nervously.\n\n\"Nope! I slept with your wife. Whiskey please.\".",
      "title": "A man finds out his wife is cheating on him...",
      "score": 31296,
      "subreddit": "jokes",
      "commentCount": 100,
      "url": "https://www.reddit.com/r/Jokes/comments/8kouw2/a_man_finds_out_his_wife_is_cheating_on_him/",
      "tags": "A man finds out his wife is cheating on him... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "Not for the easily offended - my favourite politically incorrect joke.... Man is walking through park. He sees a girl in a wheelchair crying.   \n\"What's wrong?\" man asks.   \n\"Never been kissed before\" girl says.   \nMan kisses her and she goes home happy.   \n  \nNext day man walking through same park. Sees girl in wheelchair again crying.   \n\"What's wrong?\" man asks.   \n\"Never been wined and dined before\" girl says.   \nSo man takes her out for a beautiful meal, gets her drunk and wheels her off home.   \n  \nAgain man walks through park following day. Girl still in wheelchair crying. \n\"What's wrong?\" Asks man.    \n\"Never been fucked before\" says girl.    \nSo man picks up girl and throws her in the river and says...  \n\"Well you're fucked now\"    .",
      "title": "Not for the easily offended - my favourite politically incorrect joke...",
      "score": 37355,
      "subreddit": "jokes",
      "commentCount": 103,
      "url": "https://www.reddit.com/r/Jokes/comments/6imgfq/not_for_the_easily_offended_my_favourite/",
      "tags": "Not for the easily offended - my favourite politically incorrect joke... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A guy goes into the US Postal Services to apply for a job.. The interviewer asks him, \"Are you allergic to anything?\"\nHe replies, \"Yes, caffeine. I can't drink coffee.\"\n\n\n\"OK, have you ever been in the military service?\"\n\"Yes,\" he says, \"I was in Afghanistan for one tour.\"\nThe interviewer says, \"that will give you 5 extra points toward employment.\" \n\nThen he asks, \"Are you disabled in any way?\"\nThe guy says, \"Yes. A bomb exploded near me and I lost both my testicles.\"\nThe interviewer grimaces and then says, \"Disabled in your country's service! Well that qualifies for extra bonus points!! Looking at the regulations you have got enough points for me to hire you right now. Our normal hours are from 8:00 AM to 4:00 PM. You can start tomorrow at 10:00 am, and plan on starting at 10:00 AM every day.\"\n\n\n\nThe guy is puzzled and asks, \"if the work hours are from 8:00AM to 4:00 PM , why don't you want me here until 10:00 AM ?\"\n\n\n\"This is a government job,\" the interviewer says. \"For the first two hours, we just stand around drinking coffee and scratching our balls. No point in you coming in for that.\".",
      "title": "A guy goes into the US Postal Services to apply for a job.",
      "score": 36902,
      "subreddit": "jokes",
      "commentCount": 125,
      "url": "https://www.reddit.com/r/Jokes/comments/jkezrt/a_guy_goes_into_the_us_postal_services_to_apply/",
      "tags": "A guy goes into the US Postal Services to apply for a job. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A suspected Covid-19 male patient is lying in bed in the hospital, wearing an oxygen mask over his mouth and nose. A young student female nurse appears and gives him a partial sponge bath.. \n\n\"Nurse,\"' he mumbles from behind the mask, \"are my testicles black?\"\n\nEmbarrassed, the young nurse replies, \"I don't know, Sir. I'm only here to wash your upper body and feet.\"\n\nHe struggles to ask again, \"Nurse, please check for me. Are my testicles black?\"\n\nConcerned that he might elevate his blood pressure and heart rate from worrying about his testicles, she overcomes her embarrassment and\n\npulls back the covers.\n\nShe raises his gown, holds his manhood in one hand and his testicles gently in the other.\n\nShe looks very closely and says, \"There's nothing wrong with them, Sir. They look fine.\"\n\nThe man slowly pulls off his oxygen mask, smiles at her, and says very slowly,\n\n\"Thank you very much. That was wonderful. Now listen very,\n\nvery, closely:\n\n\"Are - my - test - results - back?\".",
      "title": "A suspected Covid-19 male patient is lying in bed in the hospital, wearing an oxygen mask over his mouth and nose. A young student female nurse appears and gives him a partial sponge bath.",
      "score": 40330,
      "subreddit": "jokes",
      "commentCount": 133,
      "url": "https://www.reddit.com/r/Jokes/comments/k7t05e/a_suspected_covid19_male_patient_is_lying_in_bed/",
      "tags": "A suspected Covid-19 male patient is lying in bed in the hospital, wearing an oxygen mask over his mouth and nose. A young student female nurse appears and gives him a partial sponge bath. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A Russian, an American, and a British admiral were having a drink on an American aircraft carrier. They were talking about the bravery of their sailors. .\n\nThe Russian said, “I will demonstrate the bravery of our sailors.”\n\nHe calls a sailor over and says, “Jump off the ship. Swim under it and climb back up.”\n\nThe sailor promptly salutes and jumps off the flight deck, swims under the ship, climbs up the davits and stands in front of the admiral and salutes.\n\nThe Russian says, “That, gentlemen, is courage.\"\n\nThe American says, “That's nothing.”\n\nHe calls over a PO and says, “I want you to jump off the bows. Swim under the ship to the stern and then return.\"\n\nThe PO salutes, jumps off the bow, swims to the stern, and climbs back up to stand in front of the admiral and salutes.\n\nThe American says, “That, gentlemen, is courage.\"\n\nThe British admiral says, “That's nothing. Sailor, come here.\"\n\nThe matelot comes to attention and salutes.\n\nThe admiral says, “I want you to climb the highest mast on the carrier, jump off, swim under the boat from bow to stern and then from beam to beam then climb up the mast and do it again.\"\n\nThe matelot looks at the admiral and says, “You can fuck right off, sir!”\n\nThe admiral turns to the other two and says, “And that, gentlemen, is courage.\".",
      "title": "A Russian, an American, and a British admiral were having a drink on an American aircraft carrier. They were talking about the bravery of their sailors",
      "score": 33071,
      "subreddit": "jokes",
      "commentCount": 77,
      "url": "https://www.reddit.com/r/Jokes/comments/glc5ut/a_russian_an_american_and_a_british_admiral_were/",
      "tags": "A Russian, an American, and a British admiral were having a drink on an American aircraft carrier. They were talking about the bravery of their sailors \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "There's a little-known legend about Attila the Hun.... The story goes that Attila used to collect exotic animals that he found during his conquests. He particularly liked dangerous or fearsome animals, and his favourite was a giant snake. He was so fond of it, it was said that he brought it with him on every campaign.\n\n\nBut his snake lost its appetite, and soon stopped eating altogether; perhaps due to the stress of frequent travel and an irregular diet.\n\n\nWishing to save his prized pet, Attila sought help from the local chirurgeons and witch doctors. None of them could do anything for him, until a wizened sage suggested feeding the serpent only young female virgins.\n\n\nAttila was pleased with this idea, and was delighted to find that a city he had raided just happened to have a Christian convent with a convenient supply of the recommended food for his pet.\n\n\nBut the snake refused to eat, or even touch any of the consecrated virgins from the convent. Enraged, Attila sent for the soothsayer who advised him to have him executed.\n\n\nStanding before Attila, the old man calmly said, \"Before thou killest me, may thee first bring the snake and one of the women to me.\"\n\n\nCurious, Attila did as he asked.\n\n\nThen the old man took some bread and gave it to Attila.\n\n\n\"Now hold these in both hands,\" he instructed.\n\n\nAttila did so, and as soon as he did, the snake let out a terrifying hiss, and swallowed the virgin whole.\n\n\nTo an amazed Attila, the old man simply said,\n\n\n\"Thy anaconda don't want nun unless you've got buns, Hun.\".",
      "title": "There's a little-known legend about Attila the Hun...",
      "score": 37468,
      "subreddit": "jokes",
      "commentCount": 187,
      "url": "https://www.reddit.com/r/Jokes/comments/6os1ul/theres_a_littleknown_legend_about_attila_the_hun/",
      "tags": "There's a little-known legend about Attila the Hun... \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "English to become the official European language. The European Commission has just announced an agreement whereby English will be the official language of the European Union rather than German, which was the other possibility. \n\nAs part of the negotiations, the British Government conceded that English spelling had some room for improvement and has accepted a 5- year phase-in plan that would become known as \"Euro-English\". \n\nIn the first year, \"s\" will replace the soft \"c\". Sertainly, this will make the sivil servants jump with joy. The hard \"c\" will be dropped in favour of \"k\". This should klear up konfusion, and keyboards kan have one less letter.\n\nThere will be growing publik enthusiasm in the sekond year when the troublesome \"ph\" will be replaced with \"f\". This will make words like fotograf 20% shorter. \n\nIn the 3rd year, publik akseptanse of the new spelling kan be expekted to reach the stage where more komplikated changes are possible. \n\nGovernments will enkourage the removal of double letters which have always ben a deterent to akurate speling. \n\nAlso, al wil agre that the horibl mes of the silent \"e\" in the languag is disgrasful and it should go away. \n\nBy the 4th yer peopl wil be reseptiv to steps such as replasing \"th\" with \"z\" and \"w\" with \"v\". \n\nDuring ze fifz yer, ze unesesary \"o\" kan be dropd from vords kontaining \"ou\" and after ziz fifz yer, ve vil hav a reil sensi bl riten styl. \n\nZer vil be no mor trubl or difikultis and evrivun vil find it ezi TU understand ech oza. Ze drem of a united urop vil finali kum tru. \n\nUnd efter ze fifz yer, ve vil al be speking German like zey vunted in ze forst plas. .",
      "title": "English to become the official European language",
      "score": 35453,
      "subreddit": "jokes",
      "commentCount": 183,
      "url": "https://www.reddit.com/r/Jokes/comments/leq19j/english_to_become_the_official_european_language/",
      "tags": "English to become the official European language \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A lady approaches a priest and shyly tells him, \"Father, I have a problem. I have these two talking female parrots but, they only know how to say one thing... they keep saying 'Hi, we’re hot... do you want to *fuck us*?'\". \"That's terrible!\" says the priest. \"But, I have a solution to your problem. Bring your two parrots over to my house tomorrow. I will put them with my two male talking parrots... to whom I've taught to pray and read the bible. My parrots will then teach your parrots to stop saying that terrible filth, and your female parrots will learn to pray and worship the good Lord.\" So the next day, the lady brings her two female parrots to the priest's house. The priest's two male parrots are holding rosary beads and praying in their cage. The lady puts her female talking parrots in with the male talking Parrots, and the female parrots say, \"Hi, we're hot. Do you want to fuck us?” One male parrot looks over at the other male parrot and screams, \"put the bible away you idiot, our prayers have been answered!\"\n\n**EDIT: Thanks a lot to** u/Green_Justice710 **and the 5 anonymous redittors who have awarded me for this... thank you! I'm glad I could make you guys laugh!!**\n\n**EDIT 2: Thanks also to** u/darknep u/JMetcalf3 **and 5 other anonymous posters... you're too kind!! Thank you!**\n\n**EDIT 3: Just spent the last hour reading up on all the comments and appreciation... this thing really blew up, huh??? Well, you know what that means right?? More Edits, lol... thanks to u**[**/BlackBeard\\_727**](https://www.reddit.com/user/BlackBeard_727) **u**[**/Hirsty\\_92**](https://www.reddit.com/user/Hirsty_92) **u**[**/Cparman9**](https://www.reddit.com/user/Cparman9) **u/**[**WeHaSaulFan**](https://www.reddit.com/user/WeHaSaulFan) **u**[**/Serg2778**](https://www.reddit.com/user/Serg2778) **u/**[**Official\\_Vsauce**](https://www.reddit.com/user/Official_Vsauce) **u**[**/Jocombs**](https://www.reddit.com/user/Jocombs) **u/**[**throwRAnoitsmydog**](https://www.reddit.com/user/throwRAnoitsmydog) **u**[**/walmartlifer**](https://www.reddit.com/user/walmartlifer) **u/**[**GregHawkwind**](https://www.reddit.com/user/GregHawkwind) **u/**[**OneBraveBunny**](https://www.reddit.com/user/OneBraveBunny) **u**[**/reddit\\_guy88**](https://www.reddit.com/u/reddit_guy88) **u/**[**PolarJumper**](https://www.reddit.com/user/PolarJumper) **u/**[**NetworkMick**](https://www.reddit.com/user/NetworkMick) **and the multiple anonymous redditors as well. Glad I could tickle your funny bones!! (;**.",
      "title": "A lady approaches a priest and shyly tells him, \"Father, I have a problem. I have these two talking female parrots but, they only know how to say one thing... they keep saying 'Hi, we’re hot... do you want to *fuck us*?'\"",
      "score": 56484,
      "subreddit": "jokes",
      "commentCount": 115,
      "url": "https://www.reddit.com/r/Jokes/comments/gqexpm/a_lady_approaches_a_priest_and_shyly_tells_him/",
      "tags": "A lady approaches a priest and shyly tells him, \"Father, I have a problem. I have these two talking female parrots but, they only know how to say one thing... they keep saying 'Hi, we’re hot... do you want to *fuck us*?'\" \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A man walks into a bar and sits next to a hitman who charges $10,000 a bullet. The man says \"Aren't you the guy who charges 10k a bullet?\" The hitman replies \"Yeah, thats me.\" The man says \"I have a job for you. I got 20k spare, and I found out my wife was cheating on me with my best friend. I want you to shoot my wife in the head, and my friend in the penis.\" The hitman accepts the offer, and the man gives him the name of the hotel they are staying at.\n\nThey both arrive at the hotel, and climb to the roof of a building next to it. The hitman aims at the window of the wife's hotel room. The man says to the hitman \"Why are you taking so long? Go ahead and take the shot!\" The hitman says, \"Be patient. I'm trying to save you $10,000.\".",
      "title": "A man walks into a bar and sits next to a hitman who charges $10,000 a bullet",
      "score": 35193,
      "subreddit": "jokes",
      "commentCount": 181,
      "url": "https://www.reddit.com/r/Jokes/comments/oovvpf/a_man_walks_into_a_bar_and_sits_next_to_a_hitman/",
      "tags": "A man walks into a bar and sits next to a hitman who charges $10,000 a bullet \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A horny gorilla sees a lion bent over a small stream, taking a drink.. The gorilla runs up behind the lion, grabs on, and has his way with him. The gorilla then takes off running, with the very angry lion on his heels. As they run through the jungle, the gorilla gets a bit of a lead, and sees a British safari camp ahead.\n\nThe gorilla enters the camp, grabs some khakis that are hung out to dry, and puts on pants, a shirt, and a hat. He sits on a chair by the campfire and grabs a copy of the local paper, pretending to read, to hide his face.\n\nThe lion enters the campsite and lets out a huge roar. He yells, \"did anyone see a gorilla run through here?\"\n\nThe gorilla, in full disguise, calls out, \"you mean the one that fucked the lion up the ass?\"\n\nThe lion exclaims, \"oh my god! It's in the paper already?\".",
      "title": "A horny gorilla sees a lion bent over a small stream, taking a drink.",
      "score": 41811,
      "subreddit": "jokes",
      "commentCount": 155,
      "url": "https://www.reddit.com/r/Jokes/comments/k8vxbv/a_horny_gorilla_sees_a_lion_bent_over_a_small/",
      "tags": "A horny gorilla sees a lion bent over a small stream, taking a drink. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "Carl is in the 10th year of a life sentence when he gets a new cellmate, Jim.. ...after taking some time to size Jim up and decide that he can trust him, Carl tells Jim about his plan to escape.\n\n\"You see, \" Carl says \"for the first 5 years I was inside, I trained my digestive system to follow my command. Now I can eat something and it comes out broken down into it's components.\" Jim is skeptical, but intrigued. \n\nCarl continues: \"For the *last* five years, I've been swallowing pieces off my uniform. It's perfect, because the guards just think it's rats chewing on it.\"\n\nSo Jim asks, \"Well, what does that have to do with me? How can I help?\"\n\nCarl says \"Well, the pieces of fabric come out as individual fibers. I figure by this time next year, we'll have enough to fashion enough rope to get over the wall. I just need you to tie the fibers.\"\n\nJim, disgusted, says \"You have *got* to be kidding me!\"\n\nAnd Carl says \"I shit. You knot.\"\n\nEDIT: Wow. This blew up. Thanks to everyone for their kind words and thanks to those of you who gave Gold and Silver. Frankincense and Myrrh are also accepted..",
      "title": "Carl is in the 10th year of a life sentence when he gets a new cellmate, Jim.",
      "score": 61479,
      "subreddit": "jokes",
      "commentCount": 181,
      "url": "https://www.reddit.com/r/Jokes/comments/ae1315/carl_is_in_the_10th_year_of_a_life_sentence_when/",
      "tags": "Carl is in the 10th year of a life sentence when he gets a new cellmate, Jim. \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    },
    {
      "script": "A man is walking the Las Vegas strip, and runs into the most beautiful women he has ever met. [NSFW]. He starts talking to her, and to his luck he finds out she is a prostitute. So, he asks her.\n\n\"How much for a hand-job?\"\n\n\"5,000$\" she replies.\n\n\"5,000$?? You must be nuts, no way.\" \n\n\"Walk with me.\" She replies. He agrees and they walk for a moment to end up in front of a restaurant. \"You see this restaurant? I own this restaurant because men pay me 5,000$ for hand jobs.\"\n\nHe ponders for a moment. \"Damn, they must be pretty good then. Alright.\" He brings her back to his hotel room. Gets the hand job, and as advertised; it is the best hand job he has ever had. After he finishes, he realizes how perfect she is and asks. \"Okay, that was awesome. How much for a blow job?\"\n\n\"15,000$\" she replies.\n\n\"15,000$?!? You are out of your mind. No way!\" He shouts\n\n\"Come to the window.\" They walk to the window and she begins to point. \"You see those three casinos? I own those casinos because men pay me 15,000$ for blow jobs.\"\n\n\"Fine, how can i say no?\"\n\nOnce again, it is the best blow job of his life. He is writhing in ecstasy after finishing, and practically in love with this woman. \"Okay, I am gonna regret this. How much for the pussy?\"\n\n\"Come to the window.\" He follows her to the window, ready for anything. \"Do you see all of Las Vegas?\" She asks.\n\n\"No way! You own all of Las Vegas?!\" He exclaims, astounded.\n\n\"No..\" she looks down. \" But I would if I had a pussy...\".",
      "title": "A man is walking the Las Vegas strip, and runs into the most beautiful women he has ever met. [NSFW]",
      "score": 49404,
      "subreddit": "jokes",
      "commentCount": 72,
      "url": "https://www.reddit.com/r/Jokes/comments/7m86ni/a_man_is_walking_the_las_vegas_strip_and_runs/",
      "tags": "A man is walking the Las Vegas strip, and runs into the most beautiful women he has ever met. [NSFW] \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#stories #tips #funny #reddit #jokes #advice"
    }
  ],
  "data": {
    "type": "reddit",
    "subreddit": "jokes",
    "music": true,
    "subtitles": true,
    "upload": true,
    "chatGPT": false,
    "chatGPTImages": false,
    "watermark": "ZiaGamez",
    "videoCount": 40,
    "makeVideo": false,
    "crop": false
  },
  "name": "jokes"
}
