{
    "redditPosts": [
        {
            "script": "A man went into the confessional and said to his priest, 'I almost had an affair with another woman.'. The priest said, 'What do you mean, almost? The man said, 'Well, we got undressed and rubbed together, but then I stopped! The priest said, Rubbing together is the same as putting it in. You're not to see that woman again. For your penance, say five Hail Mary's and put $50 in the poor box!\n\nThe man left the confessional, said his prayers, and then walked over to the poor box. He paused for a moment and then started to leave.\n\nThe priest, who was watching, quickly ran over to him saying, 'I saw that. You didn't put any money in the poor box!\n\nThe man replied, Yeah, but I rubbed the $50 on the box, and according to you, that's the same as putting it in!.",
            "title": "A man went into the confessional and said to his priest, 'I almost had an affair with another woman.'",
            "score": 34713,
            "subreddit": "jokes",
            "commentCount": 64,
            "url": "https://www.reddit.com/r/Jokes/comments/t7ekha/a_man_went_into_the_confessional_and_said_to_his/",
            "tags": "A man went into the confessional and said to his priest, 'I almost had an affair with another woman.' \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#reddit #tips #funny #advice #stories #jokes",
            "fileName": "C:\\Users\\zivbe\\OneDrive\\projects\\VideoGenerator/scripts/script0.txt"
        },
        {
            "script": "A policeman was interrogating 3 guys who were training to become detectives. To test their skills in recognizing a suspect, he shows the first guys a picture for 5 seconds and then hides it. \"This is your suspect, how would you recognize him?\". \n\nThe first guy answers, \"That's easy, we'll catch him fast because he only has one eye!\"\n\nThe policeman says, \"Well...uh...that's because the picture I showed is his side profile.\"\n\nSlightly flustered by this ridiculous response, he flashes the picture for 5 seconds at the second guy and asks him, \"This is your suspect, how would you recognize him?\"\n\nThe second guy smiles, flips his hair and says, \"Ha! He'd be too easy to catch because he only has one ear!\"\n\nThe policeman angrily responds, \"What's the matter with you two?!!? Of course only one eye and one ear are showing because it's a picture of his side profile! Is that the best answer you can come up with?\"\n\nExtremely frustrated at this point, he shows the picture to the third guy and in a very testy voice asks, \"This is your suspect, how would you recognize him?\n\nHe quickly adds, \"Think hard before giving me a stupid answer.\"\n\nThe third guy looks at the picture intently for a moment and says, \"The suspect wears contact lenses.\"\n\nThe policeman is surprised and speechless because he really doesn't know himself if the suspect wears contacts or not.\n\n\"Well, that's an interesting answer. Wait here for a few minutes while I check his file and I'll get back to you on that.\"\n\nHe leaves the room and goes to his office, checks the suspect's file on his computer and comes back with a beaming smile on his face.\n\n\"Wow! I can't believe it. It's TRUE! The suspect does, in fact, wear contact lenses. Good work! How were you able to make such an astute observation?\"\n\n\"That's easy...\" the third guy replied. \"He can't wear regular glasses because he only has one eye and one ear.\".",
            "title": "A policeman was interrogating 3 guys who were training to become detectives. To test their skills in recognizing a suspect, he shows the first guys a picture for 5 seconds and then hides it. \"This is your suspect, how would you recognize him?\"",
            "score": 43488,
            "subreddit": "jokes",
            "commentCount": 132,
            "url": "https://www.reddit.com/r/Jokes/comments/kovsfl/a_policeman_was_interrogating_3_guys_who_were/",
            "tags": "A policeman was interrogating 3 guys who were training to become detectives. To test their skills in recognizing a suspect, he shows the first guys a picture for 5 seconds and then hides it. \"This is your suspect, how would you recognize him?\" \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#reddit #tips #funny #advice #stories #jokes",
            "fileName": "C:\\Users\\zivbe\\OneDrive\\projects\\VideoGenerator/scripts/script1.txt"
        },
        {
            "script": "As a butcher is shooing a dog from his shop,he sees a $10 and a note in his mouth, reading: \"5 lamb chops, please.\". As a butcher is shooing a dog from his shop,he sees a $10 and a note in his mouth, reading: \"5 lamb chops, please.\"\nAmazed, he takes the money, puts a bag of chops in the dog's mouth,and quickly closes the shop.\nHe follows the dog and watches him wait for a green light, look both ways, and\ntrot across the road to a bus-stop.\nThe dog checks the timetable and sits on the bench.\nWhen a bus arrives, he walks around to the front and looks at the number, then boards the bus.\nThe butcher follows, dumbstruck.\nAs the bus travels out into the suburbs, the dog takes in the scenery.\nAfter awhile he stands on his back paws to push the \"stop\" bell,\nthen the butcher follows him off.\nThe dog runs up to a house and drops his bag on the step.\nHe goes back down the path, takes a big run, and throws himself -Whap!- against the door.\nHe does this again and again. No answer.\nSo he jumps on a wall, walks around the garden, beats his head against a window,\njumps off, and waits at the front door.\nA big guy opens it and starts cursing and shouting at the dog.\nThe butcher runs up and screams at the guy: \"What the hell are you doing?\nThis dog's a genius!\"\nThe owner responds, \"Genius, my ass.........\nIt's the second time this week he's forgotten his keys!\".",
            "title": "As a butcher is shooing a dog from his shop,he sees a $10 and a note in his mouth, reading: \"5 lamb chops, please.\"",
            "score": 55095,
            "subreddit": "jokes",
            "commentCount": 125,
            "url": "https://www.reddit.com/r/Jokes/comments/85m3yy/as_a_butcher_is_shooing_a_dog_from_his_shophe/",
            "tags": "As a butcher is shooing a dog from his shop,he sees a $10 and a note in his mouth, reading: \"5 lamb chops, please.\" \n Like ->\n Share ->\n Follow ->\n Comment ->\n \n \n#reddit #tips #funny #advice #stories #jokes",
            "fileName": "C:\\Users\\zivbe\\OneDrive\\projects\\VideoGenerator/scripts/script2.txt"
        }
    ],
    "data": {
        "type": "reddit",
        "subreddit": "jokes",
        "music": true,
        "subtitles": true,
        "upload": false,
        "chatGPT": false,
        "chatGPTImages": false,
        "watermark": "zia_reddit_stories",
        "videoCount": 6,
        "makeVideo": false,
        "crop": false
    },
    "name": "jokes"
}